{
  "basics": {
    "name": "Ke Ni",
    "email": "keniauthor@gmail.com",
    "website": "https://github.com/dummyindex/",
    "summary": "Ph.D. Trainee in Computational Biology at the Joint Carnegie Mellon University–University of Pittsburgh Ph.D. Program (CPCB), with extensive research and engineering experience in natural language processing, computer vision, machine learning, and interdisciplinary applications.",
    "location": {
      "city": "Pittsburgh",
      "region": "PA",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "dummyindex",
        "url": "https://github.com/dummyindex/"
      }
    ]
  },
  "work": [
    {
      "company": "Ragomics Multi-Agent System Team",
      "position": "Project Lead (Volunteer)",
      "website": "https://www.raganetwork.com/",
      "startDate": "2023",
      "endDate": "Present",
      "summary": "Founded and lead the development of Ragomics, a multi-agent platform for single-cell genomics analysis. Led full-stack development, DevOps, prompt engineering, LLM fine-tuning, backend architecture, and team management.",
      "highlights": [
        "Designed a robust multi-agent system with memory management, context tracking, web integration, and dynamic prompt orchestration.",
        "Built and deployed a production-grade computation server with asynchronous job queuing using Flask and FastAPI."
      ]
    },
    {
      "company": "University of Pittsburgh, School of Medicine",
      "position": "Research Assistant",
      "website": "https://www.medschool.pitt.edu/",
      "startDate": "2021",
      "endDate": "Present",
      "summary": "Led the development of LivecellX, a deep learning computer vision framework for live-cell imaging analysis. Developed 4D temporal action detection models and contributed to open-source projects.",
      "highlights": [
        "Developed CNN-based models for segmentation correction and algorithms for trajectory analysis.",
        "Key contributor to Dynamo, a widely used scRNA-seq dynamics analysis pipeline."
      ]
    },
    {
      "company": "Shanghai Ragamuffin Networks Inc.",
      "position": "Engineer Lead",
      "startDate": "2020-12",
      "endDate": "2021-09",
      "summary": "Led a software engineering team to deliver a cloud-based platform for a commercial bodyguard firm, including GPS tracking, live streaming, and business intelligence systems.",
      "highlights": [
        "Designed full-stack architecture with React, WeChat Mini Program, Spring Boot backend, and cloud storage."
      ]
    },
    {
      "company": "FusionTech (Startup)",
      "position": "Co-Founder",
      "startDate": "2020-08",
      "endDate": "2020-12",
      "summary": "Led the design and development of an AI-driven diagnostic tool for early cancer detection using computer vision and CNN-based machine learning methods.",
      "highlights": [
        "Integrated advanced computational methods with clinical expertise for cancer diagnostics."
      ]
    },
    {
      "company": "University of California, Santa Barbara",
      "position": "Research Assistant",
      "startDate": "2016-01",
      "endDate": "2017",
      "summary": "Conducted research on LSTM-based sequence-to-sequence models, interpretable knowledge base representations, and machine reading comprehension.",
      "highlights": [
        "Published a first-author paper at ACL-IJCNLP on slang explanation and dataset construction."
      ]
    },
    {
      "company": "Arista",
      "position": "Software Engineer Intern",
      "startDate": "2017-06",
      "endDate": "2017-09",
      "summary": "Worked on sensors and transceivers software-hardware driver interfaces in C++ and Python. Developed a command line tool for transceiver temperature status."
    },
    {
      "company": "UCSB L&S IT",
      "position": "Software Engineering Intern",
      "startDate": "2016-08",
      "endDate": "2016-12",
      "summary": "Implemented features for UCSB Box, a web project, and migrated database from MySQL to PostgreSQL."
    }
  ],
  "education": [
    {
      "institution": "Joint CMU-Pitt Ph.D. Program in Computational Biology",
      "area": "Computer vision, natural language processing, machine learning, single-cell genomics, live-cell imaging",
      "studyType": "Ph.D.",
      "startDate": "2019",
      "endDate": "2025 (expected)",
      "location": "Pittsburgh, PA",
      "highlights": [
        "Transferred to University of Pittsburgh, School of Medicine in 2021 within the Ph.D. program.",
        "On leave during COVID-19 pandemics (2020-2021)",
        "Carnegie Mellon University, School of Computer Science (2019-2020)"
      ]
    },
    {
      "institution": "University of California, Santa Barbara",
      "area": "Computer Science",
      "studyType": "Master of Science",
      "startDate": "2017",
      "endDate": "2019",
      "location": "Santa Barbara, CA",
      "highlights": [
        "Research focus on natural language processing and understanding."
      ]
    },
    {
      "institution": "University of California, Santa Barbara",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "2015",
      "endDate": "2017",
      "location": "Santa Barbara, CA",
      "highlights": [
        "GPA: 3.96/4.00 (major), 3.8/4.00 (overall), High Honors, Dean’s Honor 2015-2017, graduated within two years after high school."
      ]
    }
  ],
  "awards": [
    "2017 Computing Research Association (CRA) outstanding undergraduate researcher reward nomination",
    "2015 ACM ICPC Southern California, Team Sylveon, Rank 12th",
    "2013 National (Chinese) Olympiads Informatics in Shanghai, First Prize in all the rounds"
  ],
  "skills": [
    "Natural Language Processing",
    "Computer Vision",
    "Machine Learning",
    "Reinforcement Learning",
    "Probabilistic Graphical Models",
    "Computational Genomics",
    "Structural Biology",
    "Protein Structure Prediction",
    "Biophysics",
    "Distributed Systems",
    "Graph Analysis",
    "FPGA (Vivado suite, VHDL)",
    "Cryptoengineering",
    "Augmented Reality"
  ],
  "publications": [
    "Ke Ni, et al. (in prep). RagOmics: A Scalable Autonomous Multi-agent System for Exploratory Single-Cell Omics Analysis.",
    "Ke Ni, et al. LivecellX: A Scalable Deep Learning Framework for Single-Cell Object-Oriented Analysis. BioRxiv.",
    "Ke Ni, et al. (in-prep). LivecellAction: Guiding Spatiotemporal Deep Learning Models for Precise Detection of Rare Single-Cell Actions.",
    "Ke Ni, William Yang Wang (2017). Learning to Explain Non-standard English. ACL-IJCNLP, Oral in TaiPei.",
    "Yuhao Chen, Yifei Zhang, Jiaxin Gan, Ke Ni, Ming Chen, Ivet Bahar, Jianhua Xing. (2025). GraphVelo allows for accurate inference of multimodal velocities and molecular mechanisms for single cells. BioRxiv.",
    "Sophia Hu, Yong Lu, Gaohan Yu, Zhiqian Zheng, Weikang Wang, Ke Ni, Amitava Giri, Jingyu Zhang, Yan Zhang, Kazuhide Watanabe, Guang Yao, Jianhua Xing (2025). Epithelial-Mesenchymal Transition Couples with Cell Cycle Arrest at Various Stages. BioRxiv.",
    "Yanshuo Chen, Xidong Wu, Ke Ni, Haoran Hu, Molin Yue, Wei Chen, and Heng Huang (in submission). Robust and Accurate Doublet Detection of Single-Cell Sequencing Data via Maximizing Area Under Precision-Recall Curve. BioRxiv.",
    "Yan Zhang, Xiaojie Qiu, Ke Ni, Jonathan Weissman, Ivet Bahar, Jianhua Xing. (2023). Graph-Dynamo: Learning stochastic cellular state transition dynamics from single-cell data. BioRxiv.",
    "Yanshuo Chen, Zhengmian Hu, Ke Ni, Site Feng, Wei Chen, Heng Huang. Inferring Single-Cell RNA Kinetics from Various Biological Priors. BioRxiv.",
    "Weikang Wang, Ke Ni, et al. (2024). Transiently Increased Coordination in Gene Regulation During Cell Phenotypic Transitions. PRX Life.",
    "Jason Xiaotian Dou, Minxue Jia, Nika Zaslavsky, Mark Ebeid, Runxue Bao, Shiyi Zhang, Ke Ni, Paul Pu Liang, Haiyi Mao, Zhi-Hong Mao, et al. (2022). Cell Representation Learning. NeurIPS LMRL."
  ],
  "talks": [
    "Society of Biomolecular Imaging and Informatics (SBI2) 2024, Broad Institute of MIT and Harvard – Poster on LivecellAction and short talk on LivecellX; attended in person with self-support.",
    "The Multi-Consortia Coordinating (MC2) Center for Cancer Biology – Online presenter; delivered a 1-hour talk on LivecellX.",
    "The Cancer Biology Program Trainee Progress Report – Delivered a 30-minute research presentation.",
    "CytoData 2023, Allen Institute – Participated and presented work during poster sessions; received travel award."
  ],
  "involvement": [
    "Member, ACM Chapter at UCSB, 2015-2017"
  ]
}